<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>DNSSettings</key>
			<dict>
				<key>DNSProtocol</key>
				<string>HTTPS</string>


				<key>ServerName</key>
				<string>0.0.0.0</string>

                       <key>SupplementalMatchDomains</key>
                                	<array>
<string>*.icloud.com</string>
<string>*.me.com</string>
<string>*.icloud-content.com</string>
<string>*.apple-dns.net</string>
<string>*.apple.com.edgekey.net</string>
<string>*.aaplimg.com</string>
<string>*.mzstatic.com</string>
<string>*.akadns.net</string>
<string>*.akamaihd-staging.net</string>
<string>*.akamaihd.net</string>
<string>*.akamaized-staging.net</string>
<string>*.akamaized.net</string>
<string>a248.e.akamai.net</string>
<string>icloud.com</string>
<string>*.akamaiedge.net</string>
<string>*.akamai.net</string>
<string>*.akamaitechnologies</string>
<string>*.akadns.net</string>
<string>*.2o7.net</string>
<string>*.aaplimg.com</string>
<string>*.amazonaws.com</string>
<string>*.mzstatic.com</string>
<string>*.googleapis.com</string>
<string>*.itunes-nocookie.com</string>
<string>*.itunes.com</string>
<string>*.crashlytics.com</string>
<string>*.edgekey.net</string>
<string>*.shaw.ca</string>
<string>*.shawcable.net</string>
<string>*.appdynamics.com</string>
<string>https://95.101.122.216</string>
<string>http://95.101.122.216</string>
<string>95.101.122.216</string>
<string>clients3.google.com</string>
<string>connectivitycheck.gstatic.com</string>
<string>*.android.com</string>
<string>*.miui.com</string>
<string>*.hicloud.com</string>
<string>*.googleapis.cn</string>
<string>*.wo.cn</string>
<string>*.com.cn</string>
<string>114.247.129.25</string>
<string>*:23</string>
<string>*.cn</string>
<string>msftncsi.com</string>
<string>msftconnecttest.com</string>
<string>*.opendns.com</string>

<string>network-test.debian.org</string>
<string>nmcheck.gnome.org</string>
<string>archlinux.org</string>
<string>capnet.elementary.io</string>


							

                                                                
							</array>

<key>SupplementalMatchDomainsNoSearch</key>
<integer>1</integer>

			</dict>
			<key>Name</key>
			<string>Cloudflare DNS over TLS</string>
			<key>PayloadDescription</key>
			<string>Configures device to use Cloudflare Encrypted DNS over TLS</string>
			<key>PayloadDisplayName</key>
			<string>Cloudflare DNS over TLS</string>
			<key>PayloadIdentifier</key>
			<string>com.apple.dnsSettings.managed.A6F9CB2D-F00E-4C3A-90EB-E19E5B872C4F</string>
			<key>PayloadType</key>
			<string>com.apple.dnsSettings.managed</string>
			<key>PayloadUUID</key>
			<string>A6F9CB2D-F00E-4C3A-90EB-E19E5B872C4F</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Adds the Cloudflare DNS to Big Sur and iOS 14.</string>
	<key>PayloadDisplayName</key>
	<string>Cloudflare Encrypted DNS</string>
	<key>PayloadIdentifier</key>
	<string>r.macOSBeta.0BD60CF6-64B5-4D16-BEA4-7294E93BDD4C</string>
	<key>PayloadRemovalDisallowed</key>
	<false/>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>542706A6-B588-412B-82ED-9C1604C368F3</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
</dict>
</plist>
